Black8Mamba/IMXRT1052_for_fireboard/source/openblt/Target/Source/ARMCM7_NXP_IMX1052/flash.c
/************************************************************************************//**
* \file         Source/_template/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target__template_flash
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2019  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/************************************************************************************//**
* \defgroup   Target__template_flash Flash driver of a port
* \brief      This module implements the flash EEPROM memory driver of a microcontroller
*             port. 
* \details    The flash driver manages the actual erase and program operations on the
*             flash EEPROM and the signature checksum. 
*             The signature checksum is a 32-bit value in the user program. It is used as
*             a flag to determine if a user program is present or not.
*             Newly programmed data is always first buffered in RAM buffers with a size
*             of FLASH_WRITE_BLOCK_SIZE. 
*             This driver manages a second RAM buffer of the same size, called the 
*             bootBlock. The bootBlock buffers program data that includes the interrupt 
*             vector table and the 32-bit signature checksum. The signature checksum 
*             value is written as the last step during a firmware update, hence the need
*             for the bootBlock.
*             Note that the majority of this flash driver can be used as is. The only
*             parts that need to be updated / implemented are:
*             * Macros FLASH_WRITE_BLOCK_SIZE and BOOT_FLASH_VECTOR_TABLE_CS_OFFSET.
*             * The flashLayout[]-array contents.
*             * The functions FlashEraseSectors() and FlashWriteBlock().
*             * The functions FlashWriteChecksum() and FlashVerifyChecksum().
* \ingroup    Target__template
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "fsl_flexspi.h"
#include "bsp_norflash.h"
#include "perf_counter.h"
#define LOG_TAG    "flash"
#define LOG_LVL    ELOG_LVL_DEBUG
#include "elog.h"

//arm-none-eabi-objcopy.exe -O ihex --gap-fill=0xFF MIMXRT1052_Project.axf output.hex
//arm-none-eabi-objcopy.exe -O binary --gap-fill=0xFF MIMXRT1052_Project.axf output.bin
//arm-none-eabi-objcopy.exe -O srec --gap-fill=0xFF MIMXRT1052_Project.axf output.srec

/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid sector entry index into flashLayout[]. */
#define FLASH_INVALID_SECTOR_IDX        (0xff)
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
/* TODO ##Port The FLASH_WRITE_BLOCK_SIZE should be at least 512. If for some reason this
 * is not large enough, double the size so: 512 -> 1024 -> 2048 -> 4096 etc.
 */
#define FLASH_WRITE_BLOCK_SIZE          (512)
/** \brief Total numbers of sectors in array flashLayout[]. */
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_TOTAL_SECTORS-1].sector_start + \
                                         flashLayout[FLASH_TOTAL_SECTORS-1].sector_size - 1)
/** \brief Offset into the user program's vector table where the checksum is located. 
 *         For this target it is set to the end of the vector table. Note that the 
 *         value can be overriden in blt_conf.h, because the size of the vector table
 *         could vary. When changing this value, don't forget to update the location
 *         of the checksum in the user program accordingly. Otherwise the checksum
 *         verification will always fail.
 */
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
/* TODO ##Port The bootloader uses a 32-bit checksum signature value to determine if a 
 * a valid user program is present or not. This checksum value is written by the
 * bootloader at the end of a firmware update with function FlashWriteChecksum(). Right
 * before a user program is about to be started, function FlashVerifyChecksum() is called
 * to verify the presence of a user program. Space must be reserved in the user program
 * for the checksum signature value and the bootloader needs to know where this space
 * is reserved. It is recommended to place the signature checksum right after the 
 * user program's vector table. Using this approach it is easy to reserved space for the
 * checksum signature in the user program by simply adding one more dummy entry into the
 * vector table. This macro should be set to the size of the vector table, which can then
 * be used to determine the memory address of the signature checksum.
 */
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x130)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
  blt_int8u  sector_num;                         /**< sector number                    */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_addr address, blt_int8u * data, 
                                           blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool  FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool  FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                 blt_int8u *data, blt_int32u len);
static blt_bool  FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool  FlashEraseSectors(blt_int8u first_sector_idx, 
                                   blt_int8u last_sector_idx);
static blt_int8u FlashGetSectorIdx(blt_addr address);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief   Array wit the layout of the flash memory.
 *  \details Also controls what part of the flash memory is reserved for the bootloader.
 *           If the bootloader size changes, the reserved sectors for the bootloader
 *           might need adjustment to make sure the bootloader doesn't get overwritten.
 */
static const tFlashSector flashLayout[] =
{
  /* TODO ##Port Update the contents of this array with the erase sector sizes as defined
   * in the microcontroller's reference manual. The flash sector erase sizes are
   * hardware specific and must therefore match, otherwise erase operations cannot be
   * performed properly. 
   * Besides controlling the flash erase size, this array also controls which sectors
   * are reserved for the bootloader and will therefore never be erased. The current
   * fictive implementation is for a microcontroller that can only erase flash memory
   * in chunks of 16 KB and the first 32 KB are reserved for the bootloader. Its flash
   * memory starts at 0x08000000 in the memory map.
   */
  { 0x60000000, 0x10000,  0},           /* flash sector  0 - reserved for bootloader   */
  { 0x60010000, 0x10000,  1},           /* flash sector  1 - reserved for bootloader   */
  { 0x60020000, 0x10000,  2},           /* flash sector  2 - reserved for bootloader   */
  { 0x60030000, 0x10000,  3},           /* flash sector  3 - reserved for bootloader   */
  { 0x60040000, 0x10000,  4},           /* flash sector  4 - 64kb                      */
  { 0x60050000, 0x10000,  5},           /* flash sector  5 - 64kb                      */
  { 0x60060000, 0x10000,  6},           /* flash sector  6 - 64kb                      */
  { 0x60070000, 0x10000,  7},           /* flash sector  7 - 64kb                      */
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x60080000, 0x10000,  8},           /* flash sector  8 - 64kb                      */
  { 0x60090000, 0x10000,  9},           /* flash sector  9 - 64kb                      */
  { 0x600a0000, 0x10000,  10},          /* flash sector  10 - 64kb                      */
  { 0x600b0000, 0x10000,  11},          /* flash sector  11 - 64kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
  { 0x600c0000, 0x10000,  12},          /* flash sector  12 - 64kb                      */
  { 0x600d0000, 0x10000,  13},          /* flash sector  13 - 64kb                      */
  { 0x600e0000, 0x10000,  14},          /* flash sector  14 - 64kb                      */
  { 0x600f0000, 0x10000,  15},          /* flash sector  15 - 64kb                      */
  { 0x60100000, 0x10000,  16},          /* flash sector  12 - 64kb                      */
  { 0x60110000, 0x10000,  17},          /* flash sector  13 - 64kb                      */
  { 0x60120000, 0x10000,  18},          /* flash sector  14 - 64kb                      */
  { 0x60130000, 0x10000,  19},          /* flash sector  15 - 64kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 1024)
#error "BOOT_NVM_SIZE_KB > 1024 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

